Repository: paulber19/audacityAccessEnhancementNVDAAddon
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: es, fr, ru

source: Audacity multi-track editor: accessibility enhancement
es: Editor de Audio multi-pista Audacity: complementos de accesibilidad
fr: Éditeur multipiste Audacity: complément d'accessibilité
ru: Многодорожечный редактор Audacity: улучшения доступности

source: This add-on adds extra functionality when working with Audacity * a script to report the audio position, * a script to report the selection, * a script to announce the state of the "Pause", "Play" and "record" buttons, * automatic audio position changes report , * automatic selection changes report (can be disabled), * time spin box editting support, * use of spacebar to press a button, * script to report playback/recording peak level, * script to report playback/record slider level, * script to report playback speed, * script to display add-on user manual, * script to display audacity guide written by David Bailes. This addon's version has been tested with audacity 3.4, 3.4.2, 3.3.0 and 3.3.3. Prior versions of Audacity are not supported.
es: Este complemento mejora la accesibilidad del software Audacity proporcionando: * un script para anunciar la posición de audio, * un script para anunciar la selección, * un script para anunciar el estado de los botones "Pausar", "Reproducir" y "Grabar", * anuncio automático de cambios en la posición de audio, * anuncio automático de cambios en la selección (desactivable), * soporte de voz para los cuadros de selección que definen un tiempo o una duración de Audacity, * posibilidad de usar la barra espaciadora para pulsar en un botón, * un script para anunciar el nivel actual de los vúmetros de los picos de amplitud en reproducción o en grabación, * un script para anunciar el nivel actual de los cursores de reproducción o de grabación, * un script para anunciar la velocidad de reproducción, * un script para mostrar el manual de usuario de este complemento, * un script para mostrar la guía de Audacity escrito por David Bailes. Este complemento ha sido probado con la versión de Audacity 3.4, 3.4.2, 3.3.0 y 3.3.3. Las versiones de Audacity anteriores ya no son soportadas.
ru: Это дополнение добавляет дополнительную функциональность при работе с Audacity * скрипт, сообщающий о положении звука, * скрипт для сообщения о начале и конце выделения, * скрипт для сообщения о состоянии кнопок "Пауза", "Воспроизведение" и "Запись", * автоматические сообщения об изменении позиции звука, * автоматические сообщения об изменении выделения (можно отключить), * поддержка редактирования управления таймером, * использование пробела для нажатия кнопки, * скрипт, сообщающий о пиковом уровне воспроизведения/записи, * скрипт, сообщающий об уровне ползунка воспроизведения/записи, * скрипт, сообщающий о скорости воспроизведения, * скрипт для отображения руководства пользователя дополнения, * скрипт для отображения руководства по audacity, написанного Дэвидом Бейлсом. Данная версия дополнения была протестирована с audacity 3.4, 3.4.2, 3.3.0, 3.3.3 Предыдущие версии Audacity не поддерживаются.

source: Do you want to keep current add-on configuration settings ?
es: ¿Deseas conservar las opciones de configuración del complemento actual?
fr: Voulez vous conserver les paramètres actuels de l'extension ?
ru: Вы хотите сохранить текущие настройки дополнения?

source: %s - installation
es: %s - instalación
ru: Установка - %s

source: Are you sure you don't want to keep the current add-on configuration settings?
es: ¿Estás seguro de que no deseas conservar las opciones de configuración del complemento actual?
fr: Voulez-vous vraiment ne pas conserver les paramètres de configuration actuels de l'extension ?
ru: Вы уверены, что не хотите сохранить текущие настройки дополнения?

source: The configuration file of the add-on contains errors. The configuration has been reset to factory defaults
es: El archivo de la configuración del complemento contiene errores. La configuración se ha restablecido a los valores predeterminados
fr: Le fichier de configuration de l'extension contient des erreurs. La configuration a été réinitialisée aux valeurs par défaut
ru: Файл настроек дополнения содержит ошибки. Конфигурация была сброшена к настройкам по умолчанию

source: Warning
es: Advertencia
fr: Avertissement
ru: Предупреждение

source: Informations
es: Información
ru: Информация

source: Co&py to Clipboard
es: Co&piar al portapapeles
fr: Co&pier dans le presse-papier
ru: &Скопировать в буфер обмена

source: Copied
es: Copiado
fr: Copié
ru: Скопировано

source: Error, the information cannot be copied to the clipboard
es: Error, la información no puede copiarse al portapapeles
fr: Erreur, l'information ne peut pas être copiée dans le presse-papier
ru: Ошибка, информация не может быть скопирована

source: Upper panel
es: Panel superior
fr: Panneau supérieur
ru: Верхняя панель

source: Lower panel
es: Panel inferior
fr: Panneau inférieur
ru: Нижняя панель

source: Main panel
es: Panel principal
fr: Panneau principal
ru: Главная панель

source: record button pressed
es: botón Grabar pulsado
fr: bouton enregistrement enfoncé
ru: кнопка запись нажата

source: No button pressed
es: No hay ningún botón pulsado
fr: Aucun bouton enfoncé
ru: Ни одна кнопка не нажата

source: one day
es: un día
fr: un jour
ru: один день

source: %s days
es: %s días
fr: %s jours
ru: %s дней

source: one hour
es: una hora
fr: une heure
ru: один час

source: %s hours
es: %s horas
fr: %s heures
ru: %s часов

source: 1 minute
es: Un minuto
fr: Une minute
ru: одна минута

source: %s minutes
es: %s minutos
ru: %s минут

source: 1 second {0}
es: un segundo {0}
fr: une seconde {0}
ru: Одна секунда {0}

source: {0} seconds {1}
es: {0} segundos {1}
fr: {0} secondes {1}
ru: {0} секунд {1}

source: 0 second %s
es: 0 segundos %s
fr: 0 seconde %s
ru: 0 секунд %s

source: %s second
es: %s segundos
fr: %s secondes
ru: %s секунд

source: 0 second
es: 0 segundos
fr: 0 seconde
ru: 0 секунд

source: one sample
es: una muestra
fr: un échantillon
ru: один семпл

source: %s samples
es: %s muestras
fr: %s échantillons
ru: %s семплов

source: 0 sample
es: 0 muestra
fr: 0 échantillon
ru: 0 семпл

source: Audio position at start of track
es: Posición de audio al inicio de la pista
fr: Position audio en début de piste
ru: Положение звука в начале трека

source: Audio position at selection's start
es: Posición de audio al inicio de la selección
fr: Position audio en début de sélection
ru: Положение звука в начале выделения

source: Selection:
es: Selección:
fr: Sélection:
ru: Выделение:

source: no selection
es: no hay ninguna selección
fr: aucune sélection
ru: нет выделения

source: %s dialog is allready open
es: El diálogo %s ya está abierto
fr: %s dialogue est déjà ouvert
ru: диалог %s уже открыт

source: {addonSummary}'s add-on - {dialogTitle}
es: {addonSummary} - {dialogTitle}
fr: {addonSummary} - {dialogTitle}
ru: {addonSummary} - {dialogTitle}

source: Recording stopped
es: Grabación detenida
fr: Enregistrement arrêté
ru: Запись остановлена

source: Recording
es: Grabación
fr: Enregistrement
ru: Запись

source: selection:
es: selección:
fr: sélection :
ru: выделение:

source: %s not available
es: %s no disponible
fr: %s non disponible
ru: %s недоступно

source: No track
es: No hay ninguna pista
fr: Aucune piste
ru: Нет трека

source: units of hours
es: unidades de horas
fr: unités des heures
ru: единицы часов

source: dozens of hours
es: decenas de horas
fr: dizaines des heures
ru: десятки часов

source: units of minutes
es: unidades de minutos
fr: unités des minutes
ru: единицы минут

source: dozens of minutes
es: decenas de minutos
fr: dizaines des minutes
ru: десятки минут

source: units of seconds
es: unidades de segundos
fr: unités des secondes
ru: единицы секунд

source: dozens of seconds
es: decenas de segundos
fr: dizaines des secondes
ru: десятки секунд

source: hundreds of seconds
es: centenas de segundos
fr: centaines des secondes
ru: сотни секунд

source: thounsands of seconds
es: millares de segundos
fr: milliers des secondes
ru: тысячи секунд

source: tens thousands of seconds
es: decenas de millares de segundos
fr: dizaines de milliers des secondes
ru: десятки тысяч секунд

source: hundreds thousands of seconds
es: centenas de millares de segundos
fr: centaines de milliers des secondes
ru: сотни тысяч секунд

source: tenths of seconds
es: décimas de segundos
fr: dizième des secondes
ru: десятые доли секунды

source: hundredths of seconds
es: centésimas de segundos
fr: centièmes des secondes
ru: сотые доли секунды

source: thousandths of seconds
es: milésimas de segundos
fr: millièmes des secondes
ru: милисекунды

source: units of days
es: unidades de días
fr: unités des jours
ru: единицы дней

source: dozens of days
es: decenas de días
fr: dizaines des jours
ru: десятки дней

source: units
es: unidades
fr: unités
ru: единицы

source: dozens
es: decenas
fr: dizaines
ru: десятки

source: hundreds
es: centenas
fr: centaines
ru: сотни

source: thousands
es: millares
fr: milliers
ru: тысячи

source: tens of thousands
es: decenas de millares de segundos
fr: dizaines de milliers des secondes
ru: десятки тысяч

source: hundreds of thousands
es: centenas de millares de segundos
fr: centaines de milliers des secondes
ru: сотни тысяч

source: millions
es: millones
ru: миллионы

source: units of samples
es: unidades de muestras
fr: unités des échantillonsunités des jours
ru: единицы семплов

source: dozens of samples
es: decenas de muestras
fr: dizaines des échantillons
ru: десятки семплов

source: hundreds of samples
es: centenas de muestras
fr: centaines des échantillons
ru: сотни семплов

source: thounsands of samples
es: millares de muestras
fr: milliers des échantillons
ru: тысячи семплов

source: tens thousands of samples
es: decenas de millares de muestras
fr: dizaines de milliers des échantillons
ru: десятки тысяч семплов

source: hundreds thousands of samples
es: centenas de millares de muestras
fr: centaines de milliers des échantillons
ru: сотни тысяч семплов

source: hours
es: horas
fr: heures
ru: часов

source: minutes
es: minutos
ru: минут

source: thousands seconds
es: millares de segundos
fr: milles secondes
ru: тысячи секунд

source: seconds
es: segundos
fr: secondes
ru: секунд

source: hundredths seconds
es: centésimas de segundos
fr: centièmes de secondes
ru: сотые доли секунды

source: milliseconds
es: milisegundos
fr: millisecondes
ru: милисекунд

source: days
es: días
fr: jours
ru: дней

source: thousand samples
es: millares de muestras
fr: mille échantillons
ru: тысяча семплов

source: samples
es: muestras
fr: échantillons
ru: семплы

source: Report the selection. Twice: report selection's first time. Third: report selection's second time
es: Anunciar la selección. Pulsa dos veces para anunciar su primer tiempo. Pulsa tres veces para anunciar su segundo tiempo
fr: Annoncer la sélection. Deux appuis: annoncer son premier temps. Trois appuis: annoncer son second temps
ru: Сообщает позицию выделения. При нажатии дважды быстро: сообщает позицию начала выделения. При нажатии трижды быстро: сообщает позицию конца выделения

source: Report the selection
es: Anunciar la selección
fr: Annoncer la sélection
ru: Сообщает позицию выделения

source: Report selection's first time
es: Anunciar el primer tiempo de la selección
fr: Annoncer le premier temps de la sélection
ru: Сообщает позицию начала выделения

source: Report selection's second time
es: Anunciar el segundo tiempo de la selección
fr: Annoncer le second temps de la sélection
ru: Сообщает позицию конца выделения

source: Report audio position
es: Anunciar la posición del cursor de audio
fr: Annoncer la position du curseur audio
ru: Сообщает положение звука

source: Enable or disable automatic report of selection's changes
es: Habilitar o deshabilitar el anuncio automático de cambios en la selección
fr: Activer ou désactiver l'annonce automatique des changements de sélection
ru: Включить или отключить автоматические сообщения об изменении выделения

source: Report the pressed state of Pause , Play and Record buttons
es: Anunciar el estado pulsado de los botones "Reproducir", "Pausar" y "Grabar"
fr: Annoncer l'état pressé des boutons "lecture", "Pause", et "Enregistrement"
ru: Сообщает состояние нажатых кнопок паузы, воспроизведения и записи

source: Reports the current level of playback meter peak
es: Anunciar el nivel actual del vúmetro del pico de amplitud en reproducción
fr: Annoncer le niveau courant du vu-mètre de crète en lecture
ru: Сообщает текущий пиковый уровень счётчика воспроизведения

source: Reports the current recording meter peak level
es: Anunciar el nivel actual del vúmetro del pico de amplitud en grabación
fr: Annoncer le niveau courant du vu-mètre de crète en enregistrement
ru: Сообщает текущий пиковый уровень счётчика записи

source: Reports the playback level
es: Anunciar el nivel de reproducción
fr: Annoncer le niveau de lecture
ru: Сообщает текущий уровень ползунка воспроизведения

source: Reports the recording level
es: Anunciar el nivel de grabación
fr: Annoncer le niveau d'enregistrement
ru: Сообщает текущий уровень ползунка записи

source: Reports the current playback speed level
es: Anunciar el nivel de velocidad actual de reproducción
fr: Annoncer la vitesse courante de lecture
ru: Сообщает текущую скорость воспроизведения

source: Display add-on user manual
es: Mostrar el manual del usuario para el complemento
fr: Afficher le manuel utilisateur de l'extension
ru: Показать руководство пользователя для дополнения

source: Display audacity guide
es: Mostrar la guía de Audacity
fr: Afficher le guide d'Audacity
ru: Показать руководство по audacity

source: Launch command shell
es: Ejecutar el intérprete de órdenes
fr: Lancer l'interpréteur de commande
ru: Запустить командную оболочку

source: Display shell scripts's list
es: Mostrar la lista de órdenes del intérprete del complemento
fr: Afficher la liste des scripts de l'interpréteur de commande
ru: Показать список скриптов оболочки

source: The addon audacityAccessEnhancement is not compatible with this version of Audacity. The application module will be temporarily disabled.
es: El complemento audacityAccessEnhancement no es compatible con esta versión de Audacity. El módulo de aplicación quedará temporalmente deshabilitado.
fr: L'extension audacityAccessEnhancement n'est pas compatible avec cette version d'Audacity. Le module d'application sera temporairement désactivé.
ru: Дополнение несовместимо с этой версией Audacity. Модуль приложения будет временно отключён.

source: (command: %s)
es: (órden: %s)
fr: (commande: %s)
ru: (команда: %s)

source: Report automaticaly selection's changes
es: Anunciar automáticamente los cambios en la selección
fr: Annoncer automatiquement les changements de sélection
ru: Автоматически сообщать об изменении выделения

source: Don't report automaticaly selection change
es: No anunciar automáticamente los cambios en la selección
fr: Ne pas Annoncer automatiquement les changements de sélection
ru: Не сообщать автоматически об изменении выделения

source: Not in tracks view
es: No en la vista de pista
fr: Pas dans la vue de piste
ru: Не в режиме вид трека

source: play button pressed
es: botón Reproducir pulsado
fr: bouton lecture enfoncé
ru: кнопка воспроизвести нажата

source: Pause button pressed
es: Botón Pausar pulsado
fr: Bouton pause enfoncé
ru: Кнопка приостановить нажата

source: Please wait ...
es: Espera por favor...
fr: Veuillez patienter ...
ru: Пожалуйста, подождите...

source: Error: Add-on user manual is not found
es: Error: El manual del usuario para el complemento no está disponible
fr: Erreur: le manuel utilisateur de l'extension
ru: Ошибка: Руководство пользователя для дополнения не найдено

source: Error: audacity guide is not found
es: Error: La guía de Audacity no está disponible
fr: Erreur: le guide d'audacity n'est pas disponible
ru: Ошибка: руководство по audacity не найдено

source: Shell's scripts
es: Scripts del intérprete de órdenes
fr: Scripts de l'interpréteur de commandes
ru: Скрипты оболочки

source: Scripts:
ru: Скрипты:

source: &Run script
es: &Lanzar el script
fr: &Lancer le script
ru: &Запустить скрипт

source: Options
es: Opciones
ru: Настройки

source: Use space bar and Enter keys to press button
es: Usar la barra espaciadora o la tecla Intro para pulsar en un botón
fr: Utiliser les touches barre d'espace ou Entrée pour appuyer sur un bouton
ru: Использовать клавиши "Пробел" и "Enter " для нажатия кнопок

source: Report name of toolbars's Panels
es: Anunciar el nombre de los paneles de las barras de herramientas
fr: Annoncer le nom des panneaux de barres d'outils
ru: Сообщать название панелей инструментов

source: EnhancedAnnouncement of edit spin boxes
es: Mejorar el anuncio en los cuadros de selección numérico
fr: Améliorer l'annonce des boites de sélection numérique
ru: Улучшенное оповещение о блоках редактирования вращений

source: Update
es: Actualización
fr: Mise à jour
ru: Обновление

source: Automatically check for &updates
es: Buscar automáticamente &actualizaciones
fr: Rechercher &automatiquement les mises à jour
ru: Автоматически проверять наличие обновлений

source: Update also release versions to &developpement versions
es: Actualizar también versiones estable hacia versiones de &desarrollo
fr: &Mettre aussi à jour les versions stable vers les versions de développement
ru: Обновлять официальные версии до разрабатываемых версий

source: &Check for update
es: &Buscar actualización
fr: &Rechercher une mise à jour
ru: &Проверить обновления

source: View &history
es: Ver &historial
fr: &Voir l'historique
ru: Посмотреть историю изменений

source: Settings
es: Opciones de configuración
fr: Paramètres
ru: Настройки дополнения

source: Downloading {name}
es: Descargando {name}
fr: Téléchargement de {name} en cours
ru: Загрузка {name}

source: Error downloading update for {name}.
es: Error al descargar la actualización de {name}.
fr: Erreur lors du téléchargement de la mise à jour de {name}.
ru: Ошибка при загрузке обновления {name}.

source: Cannot update {name} - missing file or invalid file format
es: No se puede actualizar {name} - archivo ausente o formato de archivo no válido
fr: Impossible de mettre à jour {name} - fichier manquant ou format de fichier incorrect
ru: Не удаётся обновить {name} - отсутствует файл или неверный формат файла

source: Updating
es: Actualizando
fr: Mise à jour en cours
ru: Обновление

source: Please wait while the add-on is being updated.
es: Por favor, espera mientras se actualiza el complemento.
fr: Veuillez patienter durant la mise à jour de l'extension.
ru: Пожалуйста, подождите, пока будет обновлено дополнение.

source: Failed to update {name} add-on
es: Fallo al actualizar el complemento {name}
fr: Échec de la mise à jour de l'extension {name}
ru: Не удалось обновить дополнение {name}

source: {summary} - update
es: {summary} - actualización
fr: {summary} - mise à jour
ru: Обновление - {summary}

source: The service is temporarily under maintenance. Please, try again later.
es: El servicio está actualmente en mantenimiento. Por favor, inténtelo de nuevo más tarde.
fr: Le service est momentanément en maintenance. Veuillez réessayer plus tard.
ru: Сервис временно находится на техническом обслуживании. Пожалуйста, повторите попытку позже.

source: The update is not compatible with this version of NVDA. Minimum NVDA version: {minYear}.{minMajor}, last tested: {testedYear}.{testedMajor}.
es: La actualización no es compatible con esta versión de NVDA. Versión mínima de NVDA: {minYear}.{minMajor}, última probada: {testedYear}.{testedMajor}.
fr: La mise à jour n'est pas compatible avec cette version de NVDA. Version minimum de NVDA : {minYear}.{minMajor}, dernière version testée : {testedYear}.{testedMajor}.
ru: Обновление несовместимо с этой версией NVDA. Минимальная версия NVDA: {minYear}.{minMajor}, последняя протестированная версия NVDA: {testedYear}.{testedMajor}.

source: New version%s is available. Do you want to download it now?
es: La nueva versión %s está disponible. ¿Quieres descargarla ahora?
fr: La nouvelle version %s est disponible. Voulez-vous la télécharger maintenant ?
ru: Доступна новая версия : %s.Хотите загрузить её прямо сейчас?

source: New version{0} is available. But it is not compatible with this version of NVDA: minimum version requred = {1}, last version tested = {2}. Do you want to ignore this incompatibility and still download it now?
es: La nueva versión{0} está disponible. Pero no es compatible con esta versión de NVDA: versión mínima requerida = {1}, última versión probada = {2}. ¿Quieres ignorar esta incompatibilidad y aún así descargarlo ahora?
fr: La nouvelle version {0} est disponible. Mais elle n'est pas compatible avec cette version de NVDA: minimum version reuqise = {1}, dernière version testée = {2}. Voulez-vous ignorer cette incompatibilité et la télécharger quand même maintenant ?
ru: Новая версия {0} доступна. Но несовместима с данной версией NVDA: minimum version requred = {1}, last version tested = {2}. Вы хотите проигнорировать эту несовместимость и загрузить её сейчас?

source: You are up-to-date. %s is the latest version.
es: Estás al día, %s es la versión más reciente.
fr: Vous êtes à jour, %s est la dernière version.
ru: Дополнение обновлено. Последняя версия: %s.

source: Oops! There was a problem checking for updates. Please retry later
es: ¡Huy! Hubo un problema al buscar las actualizaciones. Por favor, inténtelo de nuevo más tarde
fr: Oups! Il y a un problème pour rechercher les mises à jour. Réessayer ultérieurement
ru: Возникла проблема при проверке наличия обновлений. Пожалуйста, повторите попытку позже

source: &Yes
es: &Sí
fr: &Oui
ru: &Да

source: &No
fr: &Non
ru: &Нет

source: &Later
es: &Más tarde
fr: &Plus tard
ru: &Позже

source: Wha&t's new
es: Qué hay &de nuevo
fr: Quoi &de neuf
ru: Что &нового

source: This add-on adds extra functionality when working with Audacity * a script to report the audio position, * a script to report the selection, * a script to announce the state of the "Pause", "Play" and "record" buttons, * automatic audio position changes report , * automatic selection changes report (can be disabled), * time spin box editting support, * use of spacebar to press a button, * script to report playback/recording peak level, * script to report playback/record slider level, * script to report playback speed, * script to display add-on user manual, * script to display audacity guide written by David Bailes. This addon's version has been tested with audacity 3.6.2 x64, 3.5.1 x64, 3.4.2 x64, 3.3.3 and 3.3.0. Prior versions of Audacity are not supported.
fr: Cette extension améliore l'accessiblité du logiciel Audacity en apportant: * un script pour annoncer la position audio, * un script pour annoncer la sélection, * un script pour annoncer l'état des boutons "Pause", "Lecture" et "Enregistrement", * l'annonce automatique des changements de la position audio, * l'annonce automatique des changements de la sélection (désactivable), * le support vocal pour les boite de sélection définissant un temps ou une durée Audacity, * l'utilisation possible de la barre d'espace pour appuyer sur un bouton, * un script pour lire le niveau courant des vu-mètres de crète en lecture ou enregistrement, * un script pour lire le niveau courant des potentiomètres de lecture ou d'enregistrement, * un script pour lire la vitesse de lecture, * un script pour afficher le manuel utilisateur de l'extension, * un script pour afficher le guide d'audacity écrit par David Bailes. Cette version de l'extension a été testée avec audacity 3.6.2 x64, 3.5.1 x64, 3.4.2 x64, 3.3.3 et 3.3.0. Les versions d'Audacity antérieures à la 3.3.0 ne sont pas supportées.
